MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472PETI/mcu.h
/**
 *******************************************************************************
 * @file  HC32F472PETI.h
 * @brief Headerfile for HC32F472PETI series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-06-30       CDT             First version
   2023-12-15       CDT             Modify based on RM Rev1.0
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F472PETI_H__
#define __HC32F472PETI_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             1       /*!< HC32F472PETI provides MPU                                */
#define __VTOR_PRESENT            1       /*!< HC32F472PETI supported vector table registers            */
#define __NVIC_PRIO_BITS          4       /*!< HC32F472PETI uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT             1       /*!< FPU present                                          */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum {
    NMI_IRQn                    = -14, /*  2 Non Maskable                     */
    HardFault_IRQn              = -13, /*  3 Hard Fault                       */
    MemManageFault_IRQn         = -12, /*  4 MemManage Fault                  */
    BusFault_IRQn               = -11, /*  5 Bus Fault                        */
    UsageFault_IRQn             = -10, /*  6 Usage Fault                      */
    SVC_IRQn                    = -5,  /* 11 SVCall                           */
    DebugMonitor_IRQn           = -4,  /* 12 DebugMonitor                     */
    PendSV_IRQn                 = -2,  /* 14 Pend SV                          */
    SysTick_IRQn                = -1,  /* 15 System Tick                      */
    INT000_IRQn                 = 0,
    INT001_IRQn                 = 1,
    INT002_IRQn                 = 2,
    INT003_IRQn                 = 3,
    INT004_IRQn                 = 4,
    INT005_IRQn                 = 5,
    INT006_IRQn                 = 6,
    INT007_IRQn                 = 7,
    INT008_IRQn                 = 8,
    INT009_IRQn                 = 9,
    INT010_IRQn                 = 10,
    INT011_IRQn                 = 11,
    INT012_IRQn                 = 12,
    INT013_IRQn                 = 13,
    INT014_IRQn                 = 14,
    INT015_IRQn                 = 15,
    EXTINT_PORT_EIRQ0_IRQn      = 16,
    EXTINT_PORT_EIRQ1_IRQn      = 17,
    EXTINT_PORT_EIRQ2_IRQn      = 18,
    EXTINT_PORT_EIRQ3_IRQn      = 19,
    EXTINT_PORT_EIRQ4_IRQn      = 20,
    EXTINT_PORT_EIRQ5_IRQn      = 21,
    EXTINT_PORT_EIRQ6_IRQn      = 22,
    EXTINT_PORT_EIRQ7_IRQn      = 23,
    EXTINT_PORT_EIRQ8_IRQn      = 24,
    EXTINT_PORT_EIRQ9_IRQn      = 25,
    EXTINT_PORT_EIRQ10_IRQn     = 26,
    EXTINT_PORT_EIRQ11_IRQn     = 27,
    EXTINT_PORT_EIRQ12_IRQn     = 28,
    EXTINT_PORT_EIRQ13_IRQn     = 29,
    EXTINT_PORT_EIRQ14_IRQn     = 30,
    EXTINT_PORT_EIRQ15_IRQn     = 31,
    SWINT0_IRQn                 = 0,
    SWINT1_IRQn                 = 1,
    SWINT2_IRQn                 = 2,
    SWINT3_IRQn                 = 3,
    SWINT4_IRQn                 = 4,
    SWINT5_IRQn                 = 5,
    SWINT6_IRQn                 = 6,
    SWINT7_IRQn                 = 7,
    SWINT8_IRQn                 = 8,
    SWINT9_IRQn                 = 9,
    SWINT10_IRQn                = 10,
    SWINT11_IRQn                = 11,
    SWINT12_IRQn                = 12,
    SWINT13_IRQn                = 13,
    SWINT14_IRQn                = 14,
    SWINT15_IRQn                = 15,
    SWINT16_IRQn                = 16,
    SWINT17_IRQn                = 17,
    SWINT18_IRQn                = 18,
    SWINT19_IRQn                = 19,
    SWINT20_IRQn                = 20,
    SWINT21_IRQn                = 21,
    SWINT22_IRQn                = 22,
    SWINT23_IRQn                = 23,
    SWINT24_IRQn                = 24,
    SWINT25_IRQn                = 25,
    SWINT26_IRQn                = 26,
    SWINT27_IRQn                = 27,
    SWINT28_IRQn                = 28,
    SWINT29_IRQn                = 29,
    SWINT30_IRQn                = 30,
    SWINT31_IRQn                = 31,
    DMA1_ERR_IRQn               = 32,
    DMA1_TC0_BTC0_IRQn          = 33,
    DMA1_TC1_BTC1_IRQn          = 34,
    DMA1_TC2_BTC2_IRQn          = 35,
    DMA1_TC3_BTC3_IRQn          = 36,
    DMA1_TC4_BTC4_IRQn          = 37,
    DMA1_TC5_BTC5_IRQn          = 38,
    DMA1_TC6_BTC6_IRQn          = 39,
    DMA1_TC7_BTC7_IRQn          = 40,
    EFM_PEERR_RDCOL_IRQn        = 41,
    EFM_OPTEND_IRQn             = 42,
    QSPI_IRQn                   = 43,
    DCU1_IRQn                   = 44,
    DCU2_IRQn                   = 45,
    DCU3_IRQn                   = 46,
    DMA2_ERR_IRQn               = 47,
    DMA2_TC0_BTC0_IRQn          = 48,
    DMA2_TC1_BTC1_IRQn          = 49,
    DMA2_TC2_BTC2_IRQn          = 50,
    DMA2_TC3_BTC3_IRQn          = 51,
    DMA2_TC4_BTC4_IRQn          = 52,
    DMA2_TC5_BTC5_IRQn          = 53,
    DMA2_TC6_BTC6_IRQn          = 54,
    DMA2_TC7_BTC7_IRQn          = 55,
    MAU_IRQn                    = 56,
    FMAC1_FIR_IRQn              = 57,
    FMAC2_FIR_IRQn              = 58,
    FMAC3_FIR_IRQn              = 59,
    FMAC4_FIR_IRQn              = 60,
    TMR0_1_CMP_IRQn             = 61,
    TMR0_2_CMP_IRQn             = 62,
    TMR2_1_CMP_IRQn             = 63,
    TMR2_1_OVF_IRQn             = 64,
    TMR2_2_CMP_IRQn             = 65,
    TMR2_2_OVF_IRQn             = 66,
    TMR2_3_CMP_IRQn             = 67,
    TMR2_3_OVF_IRQn             = 68,
    TMR2_4_CMP_IRQn             = 69,
    TMR2_4_OVF_IRQn             = 70,
    RTC_IRQn                    = 71,
    XTAL_IRQn                   = 72,
    WKTM_IRQn                   = 73,
    SWDT_IRQn                   = 74,
    TMR6_1_GCMP_IRQn            = 75,
    TMR6_1_OVF_UDF_IRQn         = 76,
    TMR6_1_DTE_IRQn             = 77,
    TMR6_1_SCMP_IRQn            = 78,
    TMRA_1_OVF_UDF_IRQn         = 79,
    TMRA_1_CMP_IRQn             = 80,
    TMR6_2_GCMP_IRQn            = 81,
    TMR6_2_OVF_UDF_IRQn         = 82,
    TMR6_2_DTE_IRQn             = 83,
    TMR6_2_SCMP_IRQn            = 84,
    TMRA_2_OVF_UDF_IRQn         = 85,
    TMRA_2_CMP_IRQn             = 86,
    TMR6_3_GCMP_IRQn            = 87,
    TMR6_3_OVF_UDF_IRQn         = 88,
    TMR6_3_DTE_IRQn             = 89,
    TMR6_3_SCMP_IRQn            = 90,
    TMRA_3_OVF_UDF_IRQn         = 91,
    TMRA_3_CMP_IRQn             = 92,
    TMR6_4_GCMP_IRQn            = 93,
    TMR6_4_OVF_UDF_IRQn         = 94,
    TMR6_4_DTE_IRQn             = 95,
    TMR6_4_SCMP_IRQn            = 96,
    TMRA_4_OVF_UDF_IRQn         = 97,
    TMRA_4_CMP_IRQn             = 98,
    TMR6_5_GCMP_IRQn            = 99,
    TMR6_5_OVF_UDF_IRQn         = 100,
    TMR6_5_DTE_IRQn             = 101,
    TMR6_5_SCMP_IRQn            = 102,
    TMR6_6_GCMP_IRQn            = 104,
    TMR6_6_OVF_UDF_IRQn         = 105,
    TMR6_6_DTE_IRQn             = 106,
    TMR6_6_SCMP_IRQn            = 107,
    TMR6_7_GCMP_IRQn            = 108,
    TMR6_7_OVF_UDF_IRQn         = 109,
    TMR6_7_DTE_IRQn             = 110,
    TMR6_7_SCMP_IRQn            = 111,
    TMR6_8_GCMP_IRQn            = 112,
    TMR6_8_OVF_UDF_IRQn         = 113,
    TMR6_8_DTE_IRQn             = 114,
    TMR6_8_SCMP_IRQn            = 115,
    TMR6_9_GCMP_IRQn            = 116,
    TMR6_9_OVF_UDF_IRQn         = 117,
    TMR6_9_DTE_IRQn             = 118,
    TMR6_9_SCMP_IRQn            = 119,
    TMR6_10_GCMP_IRQn           = 120,
    TMR6_10_OVF_UDF_IRQn        = 121,
    TMR6_10_DTE_IRQn            = 122,
    TMR6_10_SCMP_IRQn           = 123,
    TMR4_1_GCMP_IRQn            = 124,
    TMR4_1_OVF_UDF_IRQn         = 125,
    TMR4_1_RELOAD_IRQn          = 126,
    TMR4_1_SCMP_IRQn            = 127,
    CMP1_IRQ_IRQn               = 128,
    CMP2_IRQ_IRQn               = 129,
    CMP3_IRQ_IRQn               = 130,
    CMP4_IRQ_IRQn               = 131,
    CAN1_INT_IRQn               = 132,
    CAN2_INT_IRQn               = 133,
    CAN3_INT_IRQn               = 134,
    USART1_IRQn                 = 135,
    USART2_IRQn                 = 136,
    SPI1_IRQn                   = 137,
    SPI2_IRQn                   = 138,
    TMRA_5_OVF_UDF_IRQn         = 139,
    TMRA_5_CMP_IRQn             = 140,
    TMRA_6_OVF_UDF_IRQn         = 141,
    TMRA_6_CMP_IRQn             = 142,
    USBFS_GLB_IRQn              = 143,
    EVENT_PORT1_IRQn            = 144,
    EVENT_PORT2_IRQn            = 145,
    EVENT_PORT3_IRQn            = 146,
    EVENT_PORT4_IRQn            = 147,
    USART3_IRQn                 = 148,
    USART4_IRQn                 = 149,
    SPI3_IRQn                   = 150,
    SPI4_IRQn                   = 151,
    EMB_GR0_IRQn                = 152,
    EMB_GR1_IRQn                = 153,
    EMB_GR2_IRQn                = 154,
    EMB_GR3_IRQn                = 155,
    EMB_GR4_IRQn                = 156,
    EMB_GR5_IRQn                = 157,
    EMB_GR6_IRQn                = 158,
    HASH_IRQn                   = 159,
    USART5_IRQn                 = 160,
    USART6_IRQn                 = 161,
    MDIO_IRQn                   = 162,
    PLA_IRQn                    = 163,
    I2C1_IRQn                   = 164,
    I2C2_IRQn                   = 165,
    I2C3_IRQn                   = 166,
    USART1_WUPI_IRQn            = 167,
    LVD1_IRQn                   = 168,
    LVD2_IRQn                   = 169,
    OTS_IRQn                    = 170,
    FCM_IRQn                    = 171,
    WDT_IRQn                    = 172,
    CTC_IRQn                    = 173,
    ADC1_IRQn                   = 174,
    ADC2_IRQn                   = 175,
    ADC3_IRQn                   = 176,
    TRNG_IRQn                   = 177,
    USART1_TCI_IRQn             = 178,
    USART2_TCI_IRQn             = 179,
    USART3_TCI_IRQn             = 180,
    USART4_TCI_IRQn             = 181,
    USART5_TCI_IRQn             = 182,
    USART6_TCI_IRQn             = 183,
} IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

